{"class_name": "Model", "config": {"name": "inception_v3", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_4", "batch_input_shape": [null, null, null, 3]}, "name": "input_4"}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d", "dilation_rate": [1, 1], "use_bias": false, "filters": 32, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d"}, {"inbound_nodes": [[["conv2d", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization"}, {"inbound_nodes": [[["batch_normalization", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_49", "activation": "relu", "dtype": "float32"}, "name": "activation_49"}, {"inbound_nodes": [[["activation_49", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_1", "dilation_rate": [1, 1], "use_bias": false, "filters": 32, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_1", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_1"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_50", "activation": "relu", "dtype": "float32"}, "name": "activation_50"}, {"inbound_nodes": [[["activation_50", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_2", "dilation_rate": [1, 1], "use_bias": false, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_2", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_2"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_51", "activation": "relu", "dtype": "float32"}, "name": "activation_51"}, {"inbound_nodes": [[["activation_51", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2], "dtype": "float32", "padding": "valid"}, "name": "max_pooling2d_1"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_3", "dilation_rate": [1, 1], "use_bias": false, "filters": 80, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_3"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_3", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_3"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_52", "activation": "relu", "dtype": "float32"}, "name": "activation_52"}, {"inbound_nodes": [[["activation_52", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_4", "dilation_rate": [1, 1], "use_bias": false, "filters": 192, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_4"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_4", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_4"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_53", "activation": "relu", "dtype": "float32"}, "name": "activation_53"}, {"inbound_nodes": [[["activation_53", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_2", "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2], "dtype": "float32", "padding": "valid"}, "name": "max_pooling2d_2"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_8", "dilation_rate": [1, 1], "use_bias": false, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_8"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_8", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_8"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_57", "activation": "relu", "dtype": "float32"}, "name": "activation_57"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_6", "dilation_rate": [1, 1], "use_bias": false, "filters": 48, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_6"}, {"inbound_nodes": [[["activation_57", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_9", "dilation_rate": [1, 1], "use_bias": false, "filters": 96, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_9"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_6", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_6"}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_9", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_9"}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_55", "activation": "relu", "dtype": "float32"}, "name": "activation_55"}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_58", "activation": "relu", "dtype": "float32"}, "name": "activation_58"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"trainable": true, "name": "average_pooling2d", "pool_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "dtype": "float32", "padding": "same"}, "name": "average_pooling2d"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_5", "dilation_rate": [1, 1], "use_bias": false, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_5"}, {"inbound_nodes": [[["activation_55", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_7", "dilation_rate": [1, 1], "use_bias": false, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [5, 5], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_7"}, {"inbound_nodes": [[["activation_58", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_10", "dilation_rate": [1, 1], "use_bias": false, "filters": 96, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_10"}, {"inbound_nodes": [[["average_pooling2d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_11", "dilation_rate": [1, 1], "use_bias": false, "filters": 32, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_11"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_5", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_5"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_7", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_7"}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_10", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_10"}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_11", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_11"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_54", "activation": "relu", "dtype": "float32"}, "name": "activation_54"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_56", "activation": "relu", "dtype": "float32"}, "name": "activation_56"}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_59", "activation": "relu", "dtype": "float32"}, "name": "activation_59"}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_60", "activation": "relu", "dtype": "float32"}, "name": "activation_60"}, {"inbound_nodes": [[["activation_54", 0, 0, {}], ["activation_56", 0, 0, {}], ["activation_59", 0, 0, {}], ["activation_60", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "name": "mixed0", "axis": 3, "dtype": "float32"}, "name": "mixed0"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_15", "dilation_rate": [1, 1], "use_bias": false, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_15"}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_15", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_15"}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_64", "activation": "relu", "dtype": "float32"}, "name": "activation_64"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_13", "dilation_rate": [1, 1], "use_bias": false, "filters": 48, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_13"}, {"inbound_nodes": [[["activation_64", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_16", "dilation_rate": [1, 1], "use_bias": false, "filters": 96, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_16"}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_13", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_13"}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_16", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_16"}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_62", "activation": "relu", "dtype": "float32"}, "name": "activation_62"}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_65", "activation": "relu", "dtype": "float32"}, "name": "activation_65"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"trainable": true, "name": "average_pooling2d_1", "pool_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "dtype": "float32", "padding": "same"}, "name": "average_pooling2d_1"}, {"inbound_nodes": [[["mixed0", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_12", "dilation_rate": [1, 1], "use_bias": false, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_12"}, {"inbound_nodes": [[["activation_62", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_14", "dilation_rate": [1, 1], "use_bias": false, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [5, 5], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_14"}, {"inbound_nodes": [[["activation_65", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_17", "dilation_rate": [1, 1], "use_bias": false, "filters": 96, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_17"}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_18", "dilation_rate": [1, 1], "use_bias": false, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_18"}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_12", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_12"}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_14", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_14"}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_17", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_17"}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_18", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_18"}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_61", "activation": "relu", "dtype": "float32"}, "name": "activation_61"}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_63", "activation": "relu", "dtype": "float32"}, "name": "activation_63"}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_66", "activation": "relu", "dtype": "float32"}, "name": "activation_66"}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_67", "activation": "relu", "dtype": "float32"}, "name": "activation_67"}, {"inbound_nodes": [[["activation_61", 0, 0, {}], ["activation_63", 0, 0, {}], ["activation_66", 0, 0, {}], ["activation_67", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "name": "mixed1", "axis": 3, "dtype": "float32"}, "name": "mixed1"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_22", "dilation_rate": [1, 1], "use_bias": false, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_22"}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_22", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_22"}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_71", "activation": "relu", "dtype": "float32"}, "name": "activation_71"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_20", "dilation_rate": [1, 1], "use_bias": false, "filters": 48, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_20"}, {"inbound_nodes": [[["activation_71", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_23", "dilation_rate": [1, 1], "use_bias": false, "filters": 96, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_23"}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_20", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_20"}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_23", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_23"}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_69", "activation": "relu", "dtype": "float32"}, "name": "activation_69"}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_72", "activation": "relu", "dtype": "float32"}, "name": "activation_72"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "AveragePooling2D", "config": {"trainable": true, "name": "average_pooling2d_2", "pool_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "dtype": "float32", "padding": "same"}, "name": "average_pooling2d_2"}, {"inbound_nodes": [[["mixed1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_19", "dilation_rate": [1, 1], "use_bias": false, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_19"}, {"inbound_nodes": [[["activation_69", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_21", "dilation_rate": [1, 1], "use_bias": false, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [5, 5], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_21"}, {"inbound_nodes": [[["activation_72", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_24", "dilation_rate": [1, 1], "use_bias": false, "filters": 96, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_24"}, {"inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_25", "dilation_rate": [1, 1], "use_bias": false, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_25"}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_19", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_19"}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_21", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_21"}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_24", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_24"}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_25", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_25"}, {"inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_68", "activation": "relu", "dtype": "float32"}, "name": "activation_68"}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_70", "activation": "relu", "dtype": "float32"}, "name": "activation_70"}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_73", "activation": "relu", "dtype": "float32"}, "name": "activation_73"}, {"inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_74", "activation": "relu", "dtype": "float32"}, "name": "activation_74"}, {"inbound_nodes": [[["activation_68", 0, 0, {}], ["activation_70", 0, 0, {}], ["activation_73", 0, 0, {}], ["activation_74", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "name": "mixed2", "axis": 3, "dtype": "float32"}, "name": "mixed2"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_27", "dilation_rate": [1, 1], "use_bias": false, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_27"}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_27", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_27"}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_76", "activation": "relu", "dtype": "float32"}, "name": "activation_76"}, {"inbound_nodes": [[["activation_76", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_28", "dilation_rate": [1, 1], "use_bias": false, "filters": 96, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_28"}, {"inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "batch_normalization_28", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": false, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "batch_normalization_28"}, {"inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_77", "activation": "relu", "dtype": "float32"}, "name": "activation_77"}, {"inbound_nodes": [[["mixed2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_26", "dilation_rate": [1, 1], "use_bias": false, "filters": 384, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_26"}, {"inbound_nodes": [[["activation_77", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv2d_29", "dilation_rate": [1, 1], "use_bias": false, "filters": 96, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv2d_29"}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "class_name": "BatchNormalization", "config": 