{"class_name": "Model", "config": {"name": "mobilenet_1.00_224", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_3", "batch_input_shape": [null, 224, 224, 3]}, "name": "input_3"}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv1_pad", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "conv1_pad"}, {"inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv1", "dilation_rate": [1, 1], "use_bias": false, "filters": 32, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv1"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv1_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv1_bn"}, {"inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv1_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv1_relu"}, {"inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_1", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "conv_pad_1"}, {"inbound_nodes": [[["conv_pad_1", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_dw_1", "dilation_rate": [1, 1], "use_bias": false, "depthwise_regularizer": null, "strides": [1, 1], "activation": "linear", "dtype": "float32", "activity_regularizer": null, "depthwise_constraint": null, "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_dw_1"}, {"inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_dw_1_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_dw_1_bn"}, {"inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_dw_1_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_dw_1_relu"}, {"inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_pw_1", "dilation_rate": [1, 1], "use_bias": false, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_1"}, {"inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_pw_1_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_pw_1_bn"}, {"inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_pw_1_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_pw_1_relu"}, {"inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_2", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "conv_pad_2"}, {"inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_dw_2", "dilation_rate": [1, 1], "use_bias": false, "depthwise_regularizer": null, "strides": [2, 2], "activation": "linear", "dtype": "float32", "activity_regularizer": null, "depthwise_constraint": null, "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_dw_2"}, {"inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_dw_2_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_dw_2_bn"}, {"inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_dw_2_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_dw_2_relu"}, {"inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_pw_2", "dilation_rate": [1, 1], "use_bias": false, "filters": 128, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_2"}, {"inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_pw_2_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_pw_2_bn"}, {"inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_pw_2_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_pw_2_relu"}, {"inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_3", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "conv_pad_3"}, {"inbound_nodes": [[["conv_pad_3", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_dw_3", "dilation_rate": [1, 1], "use_bias": false, "depthwise_regularizer": null, "strides": [1, 1], "activation": "linear", "dtype": "float32", "activity_regularizer": null, "depthwise_constraint": null, "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_dw_3"}, {"inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_dw_3_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_dw_3_bn"}, {"inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_dw_3_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_dw_3_relu"}, {"inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_pw_3", "dilation_rate": [1, 1], "use_bias": false, "filters": 128, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_3"}, {"inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_pw_3_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_pw_3_bn"}, {"inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_pw_3_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_pw_3_relu"}, {"inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_4", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "conv_pad_4"}, {"inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_dw_4", "dilation_rate": [1, 1], "use_bias": false, "depthwise_regularizer": null, "strides": [2, 2], "activation": "linear", "dtype": "float32", "activity_regularizer": null, "depthwise_constraint": null, "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_dw_4"}, {"inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_dw_4_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_dw_4_bn"}, {"inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_dw_4_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_dw_4_relu"}, {"inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_pw_4", "dilation_rate": [1, 1], "use_bias": false, "filters": 256, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_4"}, {"inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_pw_4_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_pw_4_bn"}, {"inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_pw_4_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_pw_4_relu"}, {"inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_5", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "conv_pad_5"}, {"inbound_nodes": [[["conv_pad_5", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_dw_5", "dilation_rate": [1, 1], "use_bias": false, "depthwise_regularizer": null, "strides": [1, 1], "activation": "linear", "dtype": "float32", "activity_regularizer": null, "depthwise_constraint": null, "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_dw_5"}, {"inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_dw_5_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_dw_5_bn"}, {"inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_dw_5_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_dw_5_relu"}, {"inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_pw_5", "dilation_rate": [1, 1], "use_bias": false, "filters": 256, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_5"}, {"inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_pw_5_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_pw_5_bn"}, {"inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_pw_5_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_pw_5_relu"}, {"inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_6", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "conv_pad_6"}, {"inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_dw_6", "dilation_rate": [1, 1], "use_bias": false, "depthwise_regularizer": null, "strides": [2, 2], "activation": "linear", "dtype": "float32", "activity_regularizer": null, "depthwise_constraint": null, "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_dw_6"}, {"inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_dw_6_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_dw_6_bn"}, {"inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_dw_6_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_dw_6_relu"}, {"inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_pw_6", "dilation_rate": [1, 1], "use_bias": false, "filters": 512, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_6"}, {"inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_pw_6_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_pw_6_bn"}, {"inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_pw_6_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_pw_6_relu"}, {"inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_7", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "conv_pad_7"}, {"inbound_nodes": [[["conv_pad_7", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_dw_7", "dilation_rate": [1, 1], "use_bias": false, "depthwise_regularizer": null, "strides": [1, 1], "activation": "linear", "dtype": "float32", "activity_regularizer": null, "depthwise_constraint": null, "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_dw_7"}, {"inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_dw_7_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_dw_7_bn"}, {"inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_dw_7_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_dw_7_relu"}, {"inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_pw_7", "dilation_rate": [1, 1], "use_bias": false, "filters": 512, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_7"}, {"inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_pw_7_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_pw_7_bn"}, {"inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_pw_7_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_pw_7_relu"}, {"inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_8", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "conv_pad_8"}, {"inbound_nodes": [[["conv_pad_8", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_dw_8", "dilation_rate": [1, 1], "use_bias": false, "depthwise_regularizer": null, "strides": [1, 1], "activation": "linear", "dtype": "float32", "activity_regularizer": null, "depthwise_constraint": null, "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_dw_8"}, {"inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_dw_8_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_dw_8_bn"}, {"inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_dw_8_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_dw_8_relu"}, {"inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_pw_8", "dilation_rate": [1, 1], "use_bias": false, "filters": 512, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_8"}, {"inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_pw_8_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_pw_8_bn"}, {"inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_pw_8_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_pw_8_relu"}, {"inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_9", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "conv_pad_9"}, {"inbound_nodes": [[["conv_pad_9", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_dw_9", "dilation_rate": [1, 1], "use_bias": false, "depthwise_regularizer": null, "strides": [1, 1], "activation": "linear", "dtype": "float32", "activity_regularizer": null, "depthwise_constraint": null, "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_dw_9"}, {"inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_dw_9_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_dw_9_bn"}, {"inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_dw_9_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_dw_9_relu"}, {"inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_pw_9", "dilation_rate": [1, 1], "use_bias": false, "filters": 512, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_9"}, {"inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_pw_9_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_pw_9_bn"}, {"inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_pw_9_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_pw_9_relu"}, {"inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_10", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "conv_pad_10"}, {"inbound_nodes": [[["conv_pad_10", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_dw_10", "dilation_rate": [1, 1], "use_bias": false, "depthwise_regularizer": null, "strides": [1, 1], "activation": "linear", "dtype": "float32", "activity_regularizer": null, "depthwise_constraint": null, "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_dw_10"}, {"inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_dw_10_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_dw_10_bn"}, {"inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_dw_10_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_dw_10_relu"}, {"inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_pw_10", "dilation_rate": [1, 1], "use_bias": false, "filters": 512, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_10"}, {"inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_pw_10_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_pw_10_bn"}, {"inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_pw_10_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_pw_10_relu"}, {"inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_11", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "conv_pad_11"}, {"inbound_nodes": [[["conv_pad_11", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_dw_11", "dilation_rate": [1, 1], "use_bias": false, "depthwise_regularizer": null, "strides": [1, 1], "activation": "linear", "dtype": "float32", "activity_regularizer": null, "depthwise_constraint": null, "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_dw_11"}, {"inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_dw_11_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_dw_11_bn"}, {"inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_dw_11_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_dw_11_relu"}, {"inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_pw_11", "dilation_rate": [1, 1], "use_bias": false, "filters": 512, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_11"}, {"inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_pw_11_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_pw_11_bn"}, {"inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_pw_11_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_pw_11_relu"}, {"inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_12", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "conv_pad_12"}, {"inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_dw_12", "dilation_rate": [1, 1], "use_bias": false, "depthwise_regularizer": null, "strides": [2, 2], "activation": "linear", "dtype": "float32", "activity_regularizer": null, "depthwise_constraint": null, "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_dw_12"}, {"inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_dw_12_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_dw_12_bn"}, {"inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_dw_12_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_dw_12_relu"}, {"inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_pw_12", "dilation_rate": [1, 1], "use_bias": false, "filters": 1024, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_12"}, {"inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_pw_12_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_pw_12_bn"}, {"inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_pw_12_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_pw_12_relu"}, {"inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "conv_pad_13", "trainable": true, "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "dtype": "float32"}, "name": "conv_pad_13"}, {"inbound_nodes": [[["conv_pad_13", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_dw_13", "dilation_rate": [1, 1], "use_bias": false, "depthwise_regularizer": null, "strides": [1, 1], "activation": "linear", "dtype": "float32", "activity_regularizer": null, "depthwise_constraint": null, "kernel_size": [3, 3], "depth_multiplier": 1, "data_format": "channels_last", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_dw_13"}, {"inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_dw_13_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_dw_13_bn"}, {"inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_dw_13_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_dw_13_relu"}, {"inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_pw_13", "dilation_rate": [1, 1], "use_bias": false, "filters": 1024, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_pw_13"}, {"inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "conv_pw_13_bn", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "conv_pw_13_bn"}, {"inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "class_name": "ReLU", "config": {"trainable": true, "name": "conv_pw_13_relu", "max_value": 6.0, "dtype": "float32"}, "name": "conv_pw_13_relu"}, {"inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d", "trainable": true, "data_format": "channels_last", "dtype": "float32"}, "name": "global_average_pooling2d"}, {"inbound_nodes": [[["global_average_pooling2d", 0, 0, {}]]], "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [1, 1, 1024], "dtype": "float32"}, "name": "reshape_1"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.001, "seed": null, "trainable": true, "name": "dropout", "dtype": "float32", "noise_shape": null}, "name": "dropout"}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv_preds", "dilation_rate": [1, 1], "use_bias": true, "filters": 1000, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv_preds"}, {"inbound_nodes": [[["conv_preds", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "act_softmax", "activation": "softmax", "dtype": "float32"}, "name": "act_softmax"}, {"inbound_nodes": [[["act_softmax", 0, 0, {}]]], "class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "target_shape": [1000], "dtype": "float32"}, "name": "reshape_2"}], "input_layers": [["input_3", 0, 0]], "output_layers": [["reshape_2", 0, 0]]}, "keras_version": "2.1.6-tf", "backend": "tensorflow"}