{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "data_format": "channels_last", "dtype": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}}, "dtype": null, "trainable": true, "kernel_constraint": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 512, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense", "bias_constraint": null}}, {"class_name": "Dropout", "config": {"seed": null, "dtype": null, "name": "dropout", "rate": 0.2, "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "dtype": "float32", "distribution": "uniform", "seed": null}}, "dtype": null, "trainable": true, "kernel_constraint": null, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "units": 10, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null}}], "keras_version": "2.1.6-tf"}