{"backend": "tensorflow", "keras_version": "2.1.6-tf", "class_name": "Model", "config": {"name": "resnet50", "layers": [{"name": "input_1", "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 224, 224, 3]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv1", "config": {"kernel_size": [7, 7], "bias_constraint": null, "strides": [2, 2], "padding": "same", "name": "conv1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "bn_conv1", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn_conv1", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "activation", "config": {"activation": "relu", "name": "activation", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn_conv1", 0, 0, {}]]]}, {"name": "max_pooling2d", "config": {"data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "name": "max_pooling2d", "strides": [2, 2], "dtype": "float32", "trainable": true}, "class_name": "MaxPooling2D", "inbound_nodes": [[["activation", 0, 0, {}]]]}, {"name": "res2a_branch2a", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "valid", "name": "res2a_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]}, {"name": "bn2a_branch2a", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn2a_branch2a", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]]}, {"name": "activation_1", "config": {"activation": "relu", "name": "activation_1", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]]}, {"name": "res2a_branch2b", "config": {"kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "padding": "same", "name": "res2a_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "bn2a_branch2b", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn2a_branch2b", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]]}, {"name": "activation_2", "config": {"activation": "relu", "name": "activation_2", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]]}, {"name": "res2a_branch2c", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "valid", "name": "res2a_branch2c", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 256, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "res2a_branch1", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "valid", "name": "res2a_branch1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 256, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]}, {"name": "bn2a_branch2c", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn2a_branch2c", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]]}, {"name": "bn2a_branch1", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn2a_branch1", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]]}, {"name": "add", "config": {"name": "add", "dtype": "float32", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]]}, {"name": "activation_3", "config": {"activation": "relu", "name": "activation_3", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"name": "res2b_branch2a", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "valid", "name": "res2b_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "bn2b_branch2a", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn2b_branch2a", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]]}, {"name": "activation_4", "config": {"activation": "relu", "name": "activation_4", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]]}, {"name": "res2b_branch2b", "config": {"kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "padding": "same", "name": "res2b_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "bn2b_branch2b", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn2b_branch2b", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]]}, {"name": "activation_5", "config": {"activation": "relu", "name": "activation_5", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]]}, {"name": "res2b_branch2c", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "valid", "name": "res2b_branch2c", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 256, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "bn2b_branch2c", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn2b_branch2c", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]]}, {"name": "add_1", "config": {"name": "add_1", "dtype": "float32", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_3", 0, 0, {}]]]}, {"name": "activation_6", "config": {"activation": "relu", "name": "activation_6", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "res2c_branch2a", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "valid", "name": "res2c_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "bn2c_branch2a", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn2c_branch2a", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]]}, {"name": "activation_7", "config": {"activation": "relu", "name": "activation_7", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]]}, {"name": "res2c_branch2b", "config": {"kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "padding": "same", "name": "res2c_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "bn2c_branch2b", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn2c_branch2b", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]]}, {"name": "activation_8", "config": {"activation": "relu", "name": "activation_8", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]]}, {"name": "res2c_branch2c", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "valid", "name": "res2c_branch2c", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 256, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "bn2c_branch2c", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn2c_branch2c", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]]}, {"name": "add_2", "config": {"name": "add_2", "dtype": "float32", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_6", 0, 0, {}]]]}, {"name": "activation_9", "config": {"activation": "relu", "name": "activation_9", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "res3a_branch2a", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [2, 2], "padding": "valid", "name": "res3a_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 128, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "bn3a_branch2a", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn3a_branch2a", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]]}, {"name": "activation_10", "config": {"activation": "relu", "name": "activation_10", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]]}, {"name": "res3a_branch2b", "config": {"kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "padding": "same", "name": "res3a_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 128, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "bn3a_branch2b", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn3a_branch2b", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]]}, {"name": "activation_11", "config": {"activation": "relu", "name": "activation_11", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]]}, {"name": "res3a_branch2c", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "valid", "name": "res3a_branch2c", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 512, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "res3a_branch1", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [2, 2], "padding": "valid", "name": "res3a_branch1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 512, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "bn3a_branch2c", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn3a_branch2c", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]]}, {"name": "bn3a_branch1", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn3a_branch1", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]]}, {"name": "add_3", "config": {"name": "add_3", "dtype": "float32", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]]}, {"name": "activation_12", "config": {"activation": "relu", "name": "activation_12", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "res3b_branch2a", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "valid", "name": "res3b_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 128, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"name": "bn3b_branch2a", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn3b_branch2a", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]]}, {"name": "activation_13", "config": {"activation": "relu", "name": "activation_13", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]]}, {"name": "res3b_branch2b", "config": {"kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "padding": "same", "name": "res3b_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 128, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "bn3b_branch2b", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn3b_branch2b", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]]}, {"name": "activation_14", "config": {"activation": "relu", "name": "activation_14", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]]}, {"name": "res3b_branch2c", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "valid", "name": "res3b_branch2c", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 512, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "bn3b_branch2c", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn3b_branch2c", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]]}, {"name": "add_4", "config": {"name": "add_4", "dtype": "float32", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"name": "activation_15", "config": {"activation": "relu", "name": "activation_15", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "res3c_branch2a", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "valid", "name": "res3c_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 128, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"name": "bn3c_branch2a", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn3c_branch2a", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]]}, {"name": "activation_16", "config": {"activation": "relu", "name": "activation_16", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]]}, {"name": "res3c_branch2b", "config": {"kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "padding": "same", "name": "res3c_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 128, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"name": "bn3c_branch2b", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn3c_branch2b", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]]}, {"name": "activation_17", "config": {"activation": "relu", "name": "activation_17", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]]}, {"name": "res3c_branch2c", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "valid", "name": "res3c_branch2c", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 512, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"name": "bn3c_branch2c", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn3c_branch2c", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]]}, {"name": "add_5", "config": {"name": "add_5", "dtype": "float32", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_15", 0, 0, {}]]]}, {"name": "activation_18", "config": {"activation": "relu", "name": "activation_18", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "res3d_branch2a", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "valid", "name": "res3d_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 128, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"name": "bn3d_branch2a", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn3d_branch2a", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]]}, {"name": "activation_19", "config": {"activation": "relu", "name": "activation_19", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]]}, {"name": "res3d_branch2b", "config": {"kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "padding": "same", "name": "res3d_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 128, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"name": "bn3d_branch2b", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn3d_branch2b", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]]}, {"name": "activation_20", "config": {"activation": "relu", "name": "activation_20", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]]}, {"name": "res3d_branch2c", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "valid", "name": "res3d_branch2c", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 512, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"name": "bn3d_branch2c", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn3d_branch2c", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]]}, {"name": "add_6", "config": {"name": "add_6", "dtype": "float32", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_18", 0, 0, {}]]]}, {"name": "activation_21", "config": {"activation": "relu", "name": "activation_21", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "res4a_branch2a", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [2, 2], "padding": "valid", "name": "res4a_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 256, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"name": "bn4a_branch2a", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn4a_branch2a", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]]}, {"name": "activation_22", "config": {"activation": "relu", "name": "activation_22", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]]}, {"name": "res4a_branch2b", "config": {"kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "padding": "same", "name": "res4a_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 256, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"name": "bn4a_branch2b", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn4a_branch2b", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]]}, {"name": "activation_23", "config": {"activation": "relu", "name": "activation_23", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]]}, {"name": "res4a_branch2c", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "valid", "name": "res4a_branch2c", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 1024, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"name": "res4a_branch1", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [2, 2], "padding": "valid", "name": "res4a_branch1", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 1024, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"name": "bn4a_branch2c", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn4a_branch2c", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]]}, {"name": "bn4a_branch1", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn4a_branch1", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]]}, {"name": "add_7", "config": {"name": "add_7", "dtype": "float32", "trainable": true}, "class_name": "Add", "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]]}, {"name": "activation_24", "config": {"activation": "relu", "name": "activation_24", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "res4b_branch2a", "config": {"kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "padding": "valid", "name": "res4b_branch2a", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 256, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"name": "bn4b_branch2a", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn4b_branch2a", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]]}, {"name": "activation_25", "config": {"activation": "relu", "name": "activation_25", "dtype": "float32", "trainable": true}, "class_name": "Activation", "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]]}, {"name": "res4b_branch2b", "config": {"kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "padding": "same", "name": "res4b_branch2b", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "filters": 256, "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "dtype": "float32"}, "class_name": "Conv2D", "inbound_nodes": [[["activation_25", 0, 0, {}]]]}, {"name": "bn4b_branch2b", "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "axis": [3], "gamma_regularizer": null, "epsilon": 0.001, "name": "bn4b_branch2b", "center": true, "trainable": true, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_constraint": null, "dtype": "float32", "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null},