{"backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "dtype": "float32", "name": "input_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "block1_conv1", "config": {"kernel_constraint": null, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block1_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "filters": 64, "trainable": true, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "name": "block1_conv2", "config": {"kernel_constraint": null, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block1_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "filters": 64, "trainable": true, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "name": "block1_pool", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "block1_pool", "dtype": "float32", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "name": "block2_conv1", "config": {"kernel_constraint": null, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block2_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "filters": 128, "trainable": true, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "name": "block2_conv2", "config": {"kernel_constraint": null, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block2_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "filters": 128, "trainable": true, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "name": "block2_pool", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "block2_pool", "dtype": "float32", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "name": "block3_conv1", "config": {"kernel_constraint": null, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block3_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "name": "block3_conv2", "config": {"kernel_constraint": null, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block3_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "name": "block3_conv3", "config": {"kernel_constraint": null, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block3_conv3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "filters": 256, "trainable": true, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "name": "block3_pool", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "block3_pool", "dtype": "float32", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "name": "block4_conv1", "config": {"kernel_constraint": null, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block4_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "filters": 512, "trainable": true, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "name": "block4_conv2", "config": {"kernel_constraint": null, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block4_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "filters": 512, "trainable": true, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "name": "block4_conv3", "config": {"kernel_constraint": null, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block4_conv3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "filters": 512, "trainable": true, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "name": "block4_pool", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "block4_pool", "dtype": "float32", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "name": "block5_conv1", "config": {"kernel_constraint": null, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block5_conv1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "filters": 512, "trainable": true, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "name": "block5_conv2", "config": {"kernel_constraint": null, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block5_conv2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "filters": 512, "trainable": true, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "name": "block5_conv3", "config": {"kernel_constraint": null, "data_format": "channels_last", "padding": "same", "activity_regularizer": null, "name": "block5_conv3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "activation": "relu", "use_bias": true, "dilation_rate": [1, 1], "filters": 512, "trainable": true, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "name": "block5_pool", "config": {"data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "block5_pool", "dtype": "float32", "padding": "valid", "strides": [2, 2]}}, {"class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "name": "flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten", "dtype": "float32"}}, {"class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]], "name": "fc1", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "name": "fc1", "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "dtype": "float32", "units": 4096, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "Dense", "inbound_nodes": [[["fc1", 0, 0, {}]]], "name": "fc2", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "name": "fc2", "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "dtype": "float32", "units": 4096, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}, {"class_name": "Dense", "inbound_nodes": [[["fc2", 0, 0, {}]]], "name": "predictions", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "dtype": "float32", "distribution": "uniform"}}, "name": "predictions", "activation": "softmax", "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "dtype": "float32", "units": 1000, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}}], "input_layers": [["input_1", 0, 0]], "name": "vgg16", "output_layers": [["predictions", 0, 0]]}, "keras_version": "2.1.6-tf"}