{"class_name": "Model", "config": {"name": "resnet50", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 224, 224, 3]}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "conv1", "dilation_rate": [1, 1], "use_bias": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [7, 7], "kernel_regularizer": null, "dtype": "float32", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "conv1"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn_conv1", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn_conv1"}, {"inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation", "activation": "relu", "dtype": "float32"}, "name": "activation"}, {"inbound_nodes": [[["activation", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d", "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2], "dtype": "float32", "padding": "valid"}, "name": "max_pooling2d"}, {"inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res2a_branch2a", "dilation_rate": [1, 1], "use_bias": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res2a_branch2a"}, {"inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn2a_branch2a", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn2a_branch2a"}, {"inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu", "dtype": "float32"}, "name": "activation_1"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res2a_branch2b", "dilation_rate": [1, 1], "use_bias": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res2a_branch2b"}, {"inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn2a_branch2b", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn2a_branch2b"}, {"inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu", "dtype": "float32"}, "name": "activation_2"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res2a_branch2c", "dilation_rate": [1, 1], "use_bias": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res2a_branch2c"}, {"inbound_nodes": [[["max_pooling2d", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res2a_branch1", "dilation_rate": [1, 1], "use_bias": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res2a_branch1"}, {"inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn2a_branch2c", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn2a_branch2c"}, {"inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn2a_branch1", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn2a_branch1"}, {"inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add", "dtype": "float32"}, "name": "add"}, {"inbound_nodes": [[["add", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu", "dtype": "float32"}, "name": "activation_3"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res2b_branch2a", "dilation_rate": [1, 1], "use_bias": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res2b_branch2a"}, {"inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn2b_branch2a", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn2b_branch2a"}, {"inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu", "dtype": "float32"}, "name": "activation_4"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res2b_branch2b", "dilation_rate": [1, 1], "use_bias": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res2b_branch2b"}, {"inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn2b_branch2b", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn2b_branch2b"}, {"inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu", "dtype": "float32"}, "name": "activation_5"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res2b_branch2c", "dilation_rate": [1, 1], "use_bias": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res2b_branch2c"}, {"inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn2b_branch2c", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn2b_branch2c"}, {"inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_3", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_1", "dtype": "float32"}, "name": "add_1"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu", "dtype": "float32"}, "name": "activation_6"}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res2c_branch2a", "dilation_rate": [1, 1], "use_bias": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res2c_branch2a"}, {"inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn2c_branch2a", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn2c_branch2a"}, {"inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu", "dtype": "float32"}, "name": "activation_7"}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res2c_branch2b", "dilation_rate": [1, 1], "use_bias": true, "filters": 64, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res2c_branch2b"}, {"inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn2c_branch2b", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn2c_branch2b"}, {"inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu", "dtype": "float32"}, "name": "activation_8"}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res2c_branch2c", "dilation_rate": [1, 1], "use_bias": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res2c_branch2c"}, {"inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn2c_branch2c", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn2c_branch2c"}, {"inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_6", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_2", "dtype": "float32"}, "name": "add_2"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu", "dtype": "float32"}, "name": "activation_9"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res3a_branch2a", "dilation_rate": [1, 1], "use_bias": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res3a_branch2a"}, {"inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn3a_branch2a", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn3a_branch2a"}, {"inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu", "dtype": "float32"}, "name": "activation_10"}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res3a_branch2b", "dilation_rate": [1, 1], "use_bias": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res3a_branch2b"}, {"inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn3a_branch2b", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn3a_branch2b"}, {"inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_11", "activation": "relu", "dtype": "float32"}, "name": "activation_11"}, {"inbound_nodes": [[["activation_11", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res3a_branch2c", "dilation_rate": [1, 1], "use_bias": true, "filters": 512, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res3a_branch2c"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res3a_branch1", "dilation_rate": [1, 1], "use_bias": true, "filters": 512, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res3a_branch1"}, {"inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn3a_branch2c", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn3a_branch2c"}, {"inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn3a_branch1", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn3a_branch1"}, {"inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_3", "dtype": "float32"}, "name": "add_3"}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_12", "activation": "relu", "dtype": "float32"}, "name": "activation_12"}, {"inbound_nodes": [[["activation_12", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res3b_branch2a", "dilation_rate": [1, 1], "use_bias": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res3b_branch2a"}, {"inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn3b_branch2a", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn3b_branch2a"}, {"inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_13", "activation": "relu", "dtype": "float32"}, "name": "activation_13"}, {"inbound_nodes": [[["activation_13", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res3b_branch2b", "dilation_rate": [1, 1], "use_bias": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res3b_branch2b"}, {"inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn3b_branch2b", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn3b_branch2b"}, {"inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_14", "activation": "relu", "dtype": "float32"}, "name": "activation_14"}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res3b_branch2c", "dilation_rate": [1, 1], "use_bias": true, "filters": 512, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res3b_branch2c"}, {"inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn3b_branch2c", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn3b_branch2c"}, {"inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_12", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_4", "dtype": "float32"}, "name": "add_4"}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_15", "activation": "relu", "dtype": "float32"}, "name": "activation_15"}, {"inbound_nodes": [[["activation_15", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res3c_branch2a", "dilation_rate": [1, 1], "use_bias": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res3c_branch2a"}, {"inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn3c_branch2a", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn3c_branch2a"}, {"inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_16", "activation": "relu", "dtype": "float32"}, "name": "activation_16"}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res3c_branch2b", "dilation_rate": [1, 1], "use_bias": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res3c_branch2b"}, {"inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn3c_branch2b", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn3c_branch2b"}, {"inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_17", "activation": "relu", "dtype": "float32"}, "name": "activation_17"}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res3c_branch2c", "dilation_rate": [1, 1], "use_bias": true, "filters": 512, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res3c_branch2c"}, {"inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn3c_branch2c", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn3c_branch2c"}, {"inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_15", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_5", "dtype": "float32"}, "name": "add_5"}, {"inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_18", "activation": "relu", "dtype": "float32"}, "name": "activation_18"}, {"inbound_nodes": [[["activation_18", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res3d_branch2a", "dilation_rate": [1, 1], "use_bias": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res3d_branch2a"}, {"inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn3d_branch2a", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn3d_branch2a"}, {"inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_19", "activation": "relu", "dtype": "float32"}, "name": "activation_19"}, {"inbound_nodes": [[["activation_19", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res3d_branch2b", "dilation_rate": [1, 1], "use_bias": true, "filters": 128, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res3d_branch2b"}, {"inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn3d_branch2b", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn3d_branch2b"}, {"inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_20", "activation": "relu", "dtype": "float32"}, "name": "activation_20"}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res3d_branch2c", "dilation_rate": [1, 1], "use_bias": true, "filters": 512, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res3d_branch2c"}, {"inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn3d_branch2c", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn3d_branch2c"}, {"inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_18", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_6", "dtype": "float32"}, "name": "add_6"}, {"inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_21", "activation": "relu", "dtype": "float32"}, "name": "activation_21"}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res4a_branch2a", "dilation_rate": [1, 1], "use_bias": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res4a_branch2a"}, {"inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn4a_branch2a", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn4a_branch2a"}, {"inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_22", "activation": "relu", "dtype": "float32"}, "name": "activation_22"}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res4a_branch2b", "dilation_rate": [1, 1], "use_bias": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res4a_branch2b"}, {"inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn4a_branch2b", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn4a_branch2b"}, {"inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_23", "activation": "relu", "dtype": "float32"}, "name": "activation_23"}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res4a_branch2c", "dilation_rate": [1, 1], "use_bias": true, "filters": 1024, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res4a_branch2c"}, {"inbound_nodes": [[["activation_21", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res4a_branch1", "dilation_rate": [1, 1], "use_bias": true, "filters": 1024, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res4a_branch1"}, {"inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn4a_branch2c", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn4a_branch2c"}, {"inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn4a_branch1", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn4a_branch1"}, {"inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "class_name": "Add", "config": {"trainable": true, "name": "add_7", "dtype": "float32"}, "name": "add_7"}, {"inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_24", "activation": "relu", "dtype": "float32"}, "name": "activation_24"}, {"inbound_nodes": [[["activation_24", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res4b_branch2a", "dilation_rate": [1, 1], "use_bias": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "padding": "valid", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res4b_branch2a"}, {"inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn4b_branch2a", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, "beta_constraint": null}, "name": "bn4b_branch2a"}, {"inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_25", "activation": "relu", "dtype": "float32"}, "name": "activation_25"}, {"inbound_nodes": [[["activation_25", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "res4b_branch2b", "dilation_rate": [1, 1], "use_bias": true, "filters": 256, "activity_regularizer": null, "activation": "linear", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "res4b_branch2b"}, {"inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "trainable": true, "name": "bn4b_branch2b", "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "epsilon": 0.001, "axis": [3], "gamma_constraint": null, "dtype": "float32", "scale": true, "center": true, "momentum": 0.99, 