{"config": {"name": "vgg19", "input_layers": [["input_2", 0, 0]], "output_layers": [["predictions", 0, 0]], "layers": [{"name": "input_2", "config": {"name": "input_2", "sparse": false, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "block1_conv1", "config": {"bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "name": "block1_conv1", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 64}, "class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "block1_conv2", "config": {"bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "name": "block1_conv2", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 64}, "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "config": {"trainable": true, "padding": "valid", "name": "block1_pool", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "config": {"bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "name": "block2_conv1", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 128}, "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "config": {"bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "name": "block2_conv2", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 128}, "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "config": {"trainable": true, "padding": "valid", "name": "block2_pool", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "config": {"bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "name": "block3_conv1", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 256}, "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "config": {"bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "name": "block3_conv2", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 256}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "config": {"bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "name": "block3_conv3", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 256}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_conv4", "config": {"bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "name": "block3_conv4", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 256}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block3_pool", "config": {"trainable": true, "padding": "valid", "name": "block3_pool", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv4", 0, 0, {}]]]}, {"name": "block4_conv1", "config": {"bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "name": "block4_conv1", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 512}, "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "config": {"bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "name": "block4_conv2", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 512}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "config": {"bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "name": "block4_conv3", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 512}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_conv4", "config": {"bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "name": "block4_conv4", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 512}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block4_pool", "config": {"trainable": true, "padding": "valid", "name": "block4_pool", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv4", 0, 0, {}]]]}, {"name": "block5_conv1", "config": {"bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "name": "block5_conv1", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 512}, "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "config": {"bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "name": "block5_conv2", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 512}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "config": {"bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "name": "block5_conv3", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 512}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_conv4", "config": {"bias_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_size": [3, 3], "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "dtype": "float32", "activation": "relu", "name": "block5_conv4", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null, "data_format": "channels_last", "filters": 512}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"name": "block5_pool", "config": {"trainable": true, "padding": "valid", "name": "block5_pool", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv4", 0, 0, {}]]]}, {"name": "flatten", "config": {"name": "flatten", "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "class_name": "Flatten", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"name": "fc1", "config": {"bias_regularizer": null, "activation": "relu", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "name": "fc1", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "units": 4096, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "fc2", "config": {"bias_regularizer": null, "activation": "relu", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "name": "fc2", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "units": 4096, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"name": "predictions", "config": {"bias_regularizer": null, "activation": "softmax", "dtype": "float32", "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "name": "predictions", "bias_constraint": null, "trainable": true, "kernel_constraint": null, "units": 1000, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "activity_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["fc2", 0, 0, {}]]]}]}, "keras_version": "2.1.6-tf", "class_name": "Model", "backend": "tensorflow"}