{"class_name": "Model", "config": {"name": "vgg19", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_2", "batch_input_shape": [null, 224, 224, 3]}, "name": "input_2"}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "block1_conv1", "dilation_rate": [1, 1], "use_bias": true, "filters": 64, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "block1_conv1"}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "block1_conv2", "dilation_rate": [1, 1], "use_bias": true, "filters": 64, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "block1_conv2"}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "block1_pool", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "dtype": "float32", "padding": "valid"}, "name": "block1_pool"}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "block2_conv1", "dilation_rate": [1, 1], "use_bias": true, "filters": 128, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "block2_conv1"}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "block2_conv2", "dilation_rate": [1, 1], "use_bias": true, "filters": 128, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "block2_conv2"}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "block2_pool", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "dtype": "float32", "padding": "valid"}, "name": "block2_pool"}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "block3_conv1", "dilation_rate": [1, 1], "use_bias": true, "filters": 256, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "block3_conv1"}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "block3_conv2", "dilation_rate": [1, 1], "use_bias": true, "filters": 256, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "block3_conv2"}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "block3_conv3", "dilation_rate": [1, 1], "use_bias": true, "filters": 256, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "block3_conv3"}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "block3_conv4", "dilation_rate": [1, 1], "use_bias": true, "filters": 256, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "block3_conv4"}, {"inbound_nodes": [[["block3_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "block3_pool", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "dtype": "float32", "padding": "valid"}, "name": "block3_pool"}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "block4_conv1", "dilation_rate": [1, 1], "use_bias": true, "filters": 512, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "block4_conv1"}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "block4_conv2", "dilation_rate": [1, 1], "use_bias": true, "filters": 512, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "block4_conv2"}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "block4_conv3", "dilation_rate": [1, 1], "use_bias": true, "filters": 512, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "block4_conv3"}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "block4_conv4", "dilation_rate": [1, 1], "use_bias": true, "filters": 512, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "block4_conv4"}, {"inbound_nodes": [[["block4_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "block4_pool", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "dtype": "float32", "padding": "valid"}, "name": "block4_pool"}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "block5_conv1", "dilation_rate": [1, 1], "use_bias": true, "filters": 512, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "block5_conv1"}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "block5_conv2", "dilation_rate": [1, 1], "use_bias": true, "filters": 512, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "block5_conv2"}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "block5_conv3", "dilation_rate": [1, 1], "use_bias": true, "filters": 512, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "block5_conv3"}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "block5_conv4", "dilation_rate": [1, 1], "use_bias": true, "filters": 512, "activity_regularizer": null, "activation": "relu", "padding": "same", "kernel_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dtype": "float32", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "block5_conv4"}, {"inbound_nodes": [[["block5_conv4", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "block5_pool", "pool_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "dtype": "float32", "padding": "valid"}, "name": "block5_pool"}, {"inbound_nodes": [[["block5_pool", 0, 0, {}]]], "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "data_format": "channels_last", "dtype": "float32"}, "name": "flatten"}, {"inbound_nodes": [[["flatten", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "fc1", "use_bias": true, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "units": 4096, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "fc1"}, {"inbound_nodes": [[["fc1", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "fc2", "use_bias": true, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "units": 4096, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "fc2"}, {"inbound_nodes": [[["fc2", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "bias_constraint": null, "trainable": true, "name": "predictions", "use_bias": true, "activity_regularizer": null, "activation": "softmax", "kernel_constraint": null, "units": 1000, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}}, "name": "predictions"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["predictions", 0, 0]]}, "keras_version": "2.1.6-tf", "backend": "tensorflow"}